#include <iostream>
#include "MenuClass.h"
using namespace std;

MenuClass::MenuClass()
{
    // 생성자
}

void MenuClass::Coffee()
{
    cout << "            스타벅스 커피 메뉴" << endl;
    cout << "-------------------------------------------------" << endl;
    cout << "메뉴             1.Short 2.Tall 3.Grande 4.Venti" << endl;
    cout << "-------------------------------------------------" << endl;
    cout << "1.아메리카노        4000   4500   5000    5500" << endl;
    cout << "2.카페라떼          4500   5000   5500    6000" << endl;
    cout << "3.카푸치노          4500   5000   5500    6000" << endl;
    cout << "4.카라멜마끼아또    5400   5900   6400    6900" << endl;
    cout << "5.화이트초콜릿모카  5400   5900   6400    6900" << endl;
    cout << "6.카페모카          5000   5500   6000    6500" << endl;
    cout << "7.돌체라떼          5400   5900   6400    6900" << endl;
    cout << endl;
}

void MenuClass::Coldbrew()
{
    cout << "        스타벅스 콜드브루 메뉴" << endl;
    cout << "-----------------------------------------------" << endl;
    cout << "메뉴               1.Tall 2.Grande  3.Venti" << endl;
    cout << "-----------------------------------------------" << endl;
    cout << "1.콜드브루오트라떼    5800   6300    6800" << endl;
    cout << "2.돌체콜드브루        6000   6500    7000" << endl;
    cout << "3.바닐라크림콜드브루  5800   6300    6800" << endl;
    cout << "4.콜드브루            4900   5400    5900" << endl;
    cout << endl;
}

void MenuClass::Frappuccino()
{
    cout << "               스타벅스 프라푸치노 메뉴" << endl;
    cout << "-----------------------------------------------------------" << endl;
    cout << "메뉴                               1.Tall 2.Grande 3.Venti" << endl;
    cout << "-----------------------------------------------------------" << endl;
    cout << "1.더블에스프레소칩프라푸치노          6300   6800   7300" << endl;
    cout << "2.제주유기농말차로만든크림프라푸치노  6300   6800   7300" << endl;
    cout << "3.자바칩프라푸치노                    6300   6800   7300" << endl;
    cout << "4.초콜릿크림칩프라푸치노              6000   6500   7000" << endl;
    cout << "5.화이트초콜릿모카프라푸치노          6000   6500   7000" << endl;
    cout << "6.모카프라푸치노                      6000   6500   7000" << endl;
    cout << "7.카라멜프라푸치노                    5900   6400   6900" << endl;
    cout << "8.에스프레소프라푸치노                5500   6000   6500" << endl;
    cout << "9.바닐라크림프라푸치노                5500   6000   6500" << endl;
    cout << endl;
}

void MenuClass::Blended()
{
    cout << "              스타벅스 블렌디드 메뉴" << endl;
    cout << "----------------------------------------------------" << endl;
    cout << "메뉴                       1.Tall  2.Grande 3.Venti" << endl;
    cout << "----------------------------------------------------" << endl;
    cout << "1.민트초콜릿칩블렌디드        6300    6800    7300" << endl;
    cout << "2.딸기딜라이트요거트블렌디드  6300    6800    7300" << endl;
    cout << "3.피치&레몬블렌디드           6300    6800    7300" << endl;
    cout << "4.망고바나나블렌디드          6300    6800    7300" << endl;
    cout << "5.망고패션프루트블렌디드      5400    5900    6400" << endl;
    cout << endl;
}

void MenuClass::Fizzio()
{
    cout << "             스타벅스 피지오 메뉴" << endl;
    cout << "---------------------------------------------------" << endl;
    cout << "메뉴                        1.Tall 2.Grande 3.Venti" << endl;
    cout << "---------------------------------------------------" << endl;
    cout << "1.쿨라임피지오                 5900   6400   6900" << endl;
    cout << "2.블랙티레모네이드피지오       5400   5900   6400" << endl;
    cout << "3.패션탱고티레모네이드피지오   5400   5900   6400" << endl;
    cout << endl;
}

void MenuClass::Tea()
{
    cout << "              스타벅스 티 메뉴" << endl;
    cout << "-------------------------------------------------" << endl;
    cout << "메뉴                      1.Tall 2.Grande 3.Venti" << endl;
    cout << "-------------------------------------------------" << endl;
    cout << "1.뉴이어시트러스티           6200   6600   7200" << endl;
    cout << "2.돌체블랙밀크티             5900   6400   6900" << endl;
    cout << "3.유자민트티                 5900   6400   6900" << endl;
    cout << "4.패션프루트티               5900   6400   6900" << endl;
    cout << "5.제주유기농말차로만든라떼   6200   6600   7200" << endl;
    cout << "6.차이티라떼                 5500   6000   6500" << endl;
    cout << "7.라임패션티                 5900   6400   6900" << endl;
    cout << "8.자몽허니블랙티             5700   6200   6700" << endl;
    cout << endl;
}